test/non-functional/gatling/src/test/resources/bodies/GetReferralOutcomeRequest.xml

<soapenv:Envelope 
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:urn="urn:riv:itintegration:registry:1" 
xmlns:urn1="urn:riv:clinicalprocess:healthcond:actoutcome:GetReferralOutcomeResponder:3" 
xmlns:urn2="urn:riv:clinicalprocess:healthcond:actoutcome:3">
   <soapenv:Header>
      <urn:LogicalAddress>VS-1</urn:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:GetReferralOutcome>
         <urn1:patientId>
            <urn2:id>192712089550</urn2:id>
            <urn2:type>1.2.752.129.2.1.3.1</urn2:type>
         </urn1:patientId>
      </urn1:GetReferralOutcome>
   </soapenv:Body>
</soapenv:Envelope>